dlls/BingNearbyRequestTemplate.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SearchWithNifEnabled xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search"><request><Context xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><ApplicationId>%1</ApplicationId><UserId>%2</UserId><Version>%3</Version><Culture>%4</Culture></Context><Properties><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>Common.cxt</Key><Value>269582</Value></KeyValueOfstringstring></Properties><Queries xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata" xmlns:common="http://schemas.microsoft.com/MobileSearch/v1/Common/metadata" xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>1</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>11274</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>5</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>11168</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>2</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>648</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>3</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>284</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>2</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>1777</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>2</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>1785</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>2</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>2686</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation><QueryInformation><Domains><DomainInformation><Category xsi:nil="true"/><Domain>Local</Domain><Range><Count>2</Count><Start>0</Start></Range></DomainInformation></Domains><Locations><Location><LocationInformation><EntityType>Address</EntityType><Coordinate><common:Latitude>%5</common:Latitude><common:Longitude>%6</common:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><a:KeyValueOfstringstring><a:Key>Category</a:Key><a:Value>true</a:Value></a:KeyValueOfstringstring><a:KeyValueOfstringstring><a:Key>LocalID</a:Key><a:Value>1930</a:Value></a:KeyValueOfstringstring></Properties><QueryString> </QueryString></QueryInformation></Queries></request></SearchWithNifEnabled></soap:Body></soap:Envelope>